agents/frontend/architecture/performance_modeling/config.yaml
# Agent specification for Performance Modeling Agent (`performance_modeling`).
# Stage: architecture. Role: worker. HTTP port: 8204.
# Early performance models project latency, bandwidth, and bottlenecks under named workloads. Assumptions and uncertainty travel with every metric so architecture decisions stay auditable.
# Every key below is loaded by EdaAgent.read_spec / AgentService at startup.
# Comments are documentation only; they do not change runtime behavior.

# Fleet manifest schema version; must match the agentfleet loader.
apiVersion: agentfleet/v1
# Resource kind. Agent means this YAML is an agent specification.
kind: Agent
# Human-facing identity and labels used by fleet discovery and dashboards.
metadata:
  # Stable agent id `performance_modeling` used in routing and telemetry.
  name: performance_modeling
  # Dashboard title for `performance_modeling`.
  display_name: Performance Modeling Agent
  # Charter shown to planners and operators.
  description: Model target workloads and bottlenecks, and report projected metrics with their assumptions.
  # Labels expose stage and role.
  labels:
    # Lifecycle stage `architecture` for planner routing.
    stage: architecture
    # Agent role `worker` (lead vs worker) controlling delegation rights.
    role: worker
# Agent role `worker` (lead vs worker) controlling delegation rights.
role: worker
# Lifecycle stage `architecture` for planner routing.
stage: architecture
# Charter repeated at the top level for validators and planners.
responsibility: Model target workloads and bottlenecks, and report projected metrics with their assumptions.
# Hard may / may_not limits that prevent unsafe cross-stage edits.
boundary:
  # Actions this agent is allowed to perform on candidates and reports.
  may:
  # Allowed action: Read workload descriptions and interface contracts
  - Read workload descriptions and interface contracts
  # Allowed action: Write a performance model into an isolated candidate
  - Write a performance model into an isolated candidate
  # Allowed action: Publish a bottleneck finding with the model artifact
  - Publish a bottleneck finding with the model artifact
  # Actions forbidden even if a tool adapter could physically do them.
  may_not:
  # Forbidden action: Change the requirement set
  - Change the requirement set
  # Forbidden action: Claim a projection is a measured result
  - Claim a projection is a measured result
  # Forbidden action: Promote a candidate onto the canonical baseline
  - Promote a candidate onto the canonical baseline
  # Forbidden action: Approve a waiver or relax a hard requirement
  - Approve a waiver or relax a hard requirement
  # Forbidden action: Treat its own summary as independent signoff
  - Treat its own summary as independent signoff
# Worker agent ids this lead may open tasks against.
delegates_to: []
# Optional gate agents that must approve before promotion.
validators: []
# How peer services reach this agent's HTTP surface.
connection:
  # Docker host alias so containers reach the published port on the host.
  host: host.docker.internal
  # TCP port for this agent; must match Dockerfile EXPOSE (8204).
  port: 8204
  # Relative HTTP paths for health and task execution.
  endpoints:
    # Liveness HTTP path for compose/fleet probes.
    health: /health
    # Task execution HTTP path used by the orchestrator.
    execute: /tasks/execute
# Where tool jobs run; type none means stub observations until bound.
backend:
  # none = no live EDA backend; tools return not_run stubs.
  type: none
# How the runtime invokes skills for this agent.
execution:
  # direct_function invokes Python skills in-process.
  mode: direct_function
  # Limits parallel task load on this container.
  concurrency:
    # Serialise tasks when 1 so candidate edits do not race.
    max_tasks: 1
# Timeouts and retry policy for failed tool or LLM turns.
reliability:
  # Abort tasks that exceed 120 seconds.
  task_timeout_secs: 120
  # Retry budget `1` before giving up / replanning.
  max_retries: 1
  # Planner policy `replan` after task failure.
  on_failure: replan
# Advertised skill ids the planner may schedule.
capabilities:
# Identifier `characterize_workload` under `capabilities` for `performance_modeling`.
- id: characterize_workload
  # One-line charter of what this agent owns in the chip flow.
  description: Summarize traffic, data sizes, and latency bounds for one workload.
# Identifier `write_performance_model` under `capabilities` for `performance_modeling`.
- id: write_performance_model
  # One-line charter of what this agent owns in the chip flow.
  description: Write an executable performance model for one architecture candidate.
# Identifier `set_model_assumption` under `capabilities` for `performance_modeling`.
- id: set_model_assumption
  # One-line charter of what this agent owns in the chip flow.
  description: Record one assumption the model depends on.
# Identifier `run_performance_model` under `capabilities` for `performance_modeling`.
- id: run_performance_model
  # One-line charter of what this agent owns in the chip flow.
  description: Execute the bound performance model and record projected metrics.
# Identifier `sweep_model_parameter` under `capabilities` for `performance_modeling`.
- id: sweep_model_parameter
  # One-line charter of what this agent owns in the chip flow.
  description: Rerun the model over one parameter range.
# Identifier `read_projected_metrics` under `capabilities` for `performance_modeling`.
- id: read_projected_metrics
  # One-line charter of what this agent owns in the chip flow.
  description: Read throughput, latency, and utilization from a model run.
# Identifier `read_sensitivity` under `capabilities` for `performance_modeling`.
- id: read_sensitivity
  # One-line charter of what this agent owns in the chip flow.
  description: Read how a projected metric moves when one assumption changes.
# Identifier `compare_model_to_requirement` under `capabilities` for `performance_modeling`.
- id: compare_model_to_requirement
  # One-line charter of what this agent owns in the chip flow.
  description: Compare projected metrics with the numeric requirement.
# Identifier `report_bottlenecks` under `capabilities` for `performance_modeling`.
- id: report_bottlenecks
  # One-line charter of what this agent owns in the chip flow.
  description: Publish the dominant throughput or latency limiters.
# Identifier `report_model_uncertainty` under `capabilities` for `performance_modeling`.
- id: report_model_uncertainty
  # One-line charter of what this agent owns in the chip flow.
  description: Publish which projections are sensitive to an unmeasured assumption.
# Identifier `flag_model_requirement_miss` under `capabilities` for `performance_modeling`.
- id: flag_model_requirement_miss
  # One-line charter of what this agent owns in the chip flow.
  description: Publish a requirement the model says the candidate misses.
# Identifier `record_model_version` under `capabilities` for `performance_modeling`.
- id: record_model_version
  # One-line charter of what this agent owns in the chip flow.
  description: Record the model source, inputs, and version used for a projection.
# Binding of capability ids to Python callables and action kinds.
skills:
# Identifier `characterize_workload` under `skills` for `performance_modeling`.
- id: characterize_workload
  # Module path exporting the skill callable (always `tools` here).
  module: tools
  # Python function in tools.py implementing this skill.
  callable: characterize_workload
  # One-line charter of what this agent owns in the chip flow.
  description: Summarize traffic, data sizes, and latency bounds for one workload.
  # Default argument values when the planner omits them.
  args_defaults:
    # Artifact URI of the isolated design candidate this skill reads or edits; empty often means create-from-baseline.
    candidate_ref: ''
    # Artifact URI of a prior report. Empty reads the latest report for this candidate.
    report_ref: ''
    # PVT corner (process/voltage/temperature). Empty when the job is not corner-specific.
    corner: ''
    # direct_function calls Python tools in-process rather than shelling out.
    mode: ''
  # Reads structured report artifacts without mutating the candidate.
  action: read_reports
  # Documented parameter list for UI and schema generation.
  params:
  # Stable agent id used in routing, telemetry, and delegate targets.
  - name: candidate_ref
    # One-line charter of what this agent owns in the chip flow.
    description: Candidate whose reports are read.
  # Stable agent id used in routing, telemetry, and delegate targets.
  - name: report_ref
    # One-line charter of what this agent owns in the chip flow.
    description: Artifact URI of the report. Empty reads the latest report for this candidate.
  # Stable agent id used in routing, telemetry, and delegate targets.
  - name: corner
    # One-line charter of what this agent owns in the chip flow.
    description: Corner filter. Empty reads every available corner.
  # Stable agent id used in routing, telemetry, and delegate targets.
  - name: mode
    # One-line charter of what this agent owns in the chip flow.
    description: Mode filter. Empty reads every available mode.
# Identifier `write_performance_model` under `skills` for `performance_modeling`.
- id: write_performance_model
  # Module path exporting the skill callable (always `tools` here).
  module: tools
  # Python function in tools.py implementing this skill.
  callable: write_performance_model
  # One-line charter of what this agent owns in the chip flow.
  description: Write an executable performance model for one architecture candidate.
  # Default argument values when the planner omits them.
  args_defaults:
    # Artifact URI of the isolated design candidate this skill reads or edits; empty often means create-from-baseline.
    candidate_ref: ''
    # Immutable baseline revision the candidate must descend from so lineage stays auditable.
    baseline_ref: ''
    # Single change under test for this edit so experiments stay one-hypothesis-at-a-time.
    hypothesis: ''
  # Mutates only an isolated candidate branch, never the canonical baseline.
  action: write_candidate
  # Documented parameter list for UI and schema generation.
  params:
  # Stable agent id used in routing, telemetry, and delegate targets.
  - name: candidate_ref
    # One-line charter of what this agent owns in the chip flow.
    description: Isolated candidate to edit. Empty means create one from the baseline.
  # Stable agent id used in routing, telemetry, and delegate targets.
  - name: baseline_ref
    # One-line charter of what this agent owns in the chip flow.
    description: Immutable baseline the candidate must descend from.
  # Stable agent id used in routing, telemetry, and delegate targets.
  - name: hypothesis
    # One-line charter of what this agent owns in the chip flow.
    description: The single change this edit is testing.
# Identifier `set_model_assumption` under `skills` for `performance_modeling`.
- id: set_model_assumption
  # Module path exporting the skill callable (always `tools` here).
  module: tools
  # Python function in tools.py implementing this skill.
  callable: set_model_assumption
  # One-line charter of what this agent owns in the chip flow.
  description: Record one assumption the model depends on.
  # Default argument values when the planner omits them.
  args_defaults:
    # Artifact URI of the isolated design candidate this skill reads or edits; empty often means create-from-baseline.
    candidate_ref: ''
    # Immutable baseline revision the candidate must descend from so lineage stays auditable.
    baseline_ref: ''
    # Single change under test for this edit so experiments stay one-hypothesis-at-a-time.
    hypothesis: ''
  # Mutates only an isolated candidate branch, never the canonical baseline.
  action: write_candidate
  # Documented parameter list for UI and schema generation.
  params:
  # Stable agent id used in routing, telemetry, and delegate targets.
  - name: candidate_ref
    # One-line charter of what this agent owns in the chip flow.
    description: Isolated candidate to edit. Empty means create one from the baseline.
  # Stable agent id used in routing, telemetry, and delegate targets.
  - name: baseline_ref
    # One-line charter of what this agent owns in the chip flow.
    description: Immutable baseline the candidate must descend from.
  # Stable agent id used in routing, telemetry, and delegate targets.
  - name: hypothesis
    # One-line charter of what this agent owns in the chip flow.
    description: The single change this edit is testing.
# Identifier `run_performance_model` under `skills` for `performance_modeling`.
- id: run_performance_model
  # Module path exporting the skill callable (always `tools` here).
  module: tools
  # Python function in tools.py implementing this skill.
  callable: run_performance_model
  # One-line charter of what this agent owns in the chip flow.
  description: Execute the bound performance model and record projected metrics.
  # Default argument values when the planner omits them.
  args_defaults:
    # Artifact URI of the isolated design candidate this skill reads or edits; empty often means create-from-baseline.
    candidate_ref: ''
    # Immutable baseline revision the candidate must descend from so lineage stays auditable.
    baseline_ref: ''
    # Versioned EDA-tool recipe name; the framework adapter rejects unknown recipes.
    recipe: ''
    # PVT corner (process/voltage/temperature). Empty when the job is not corner-specific.
    corner: ''
    # direct_function calls Python tools in-process rather than shelling out.
    mode: ''
  # Queues an EDA tool job through the bound adapter (stubbed as not_run until bound).
  action: submit_tool_job
  # Documented parameter list for UI and schema generation.
  params:
  # Stable agent id used in routing, telemetry, and delegate targets.
  - name: candidate_ref
    # One-line charter of what this agent owns in the chip flow.
    description: Candidate the job reads.
  # Stable agent id used in routing, telemetry, and delegate targets.
  - name: baseline_ref
    # One-line charter of what this agent owns in the chip flow.
    description: Baseline used when the job compares against a known result.
  # Stable agent id used in routing, telemetry, and delegate targets.
  - name: recipe
    # One-line charter of what this agent owns in the chip flow.
    description: Versioned tool recipe. The adapter rejects an unknown recipe.
  # Stable agent id used in routing, telemetry, and delegate targets.
  - name: corner
    # One-line charter of what this agent owns in the chip flow.
    description: PVT corner. Empty when the job is not corner-specific.
  # Stable agent id used in routing, telemetry, and delegate targets.
  - name: mode
    # One-line charter of what this agent owns in the chip flow.
    description: Functional or analysis mode. Empty when the job is not mode-specific.
# Identifier `sweep_model_parameter` under `skills` for `performance_modeling`.
- id: sweep_model_parameter
  # Module path exporting the skill callable (always `tools` here).
  module: tools
  # Python function in tools.py implementing this skill.
  callable: sweep_model_parameter
  # One-line charter of what this agent owns in the chip flow.
  description: Rerun the model over one parameter range.
  # Default argument values when the planner omits them.
  args_defaults:
    # Artifact URI of the isolated design candidate this skill reads or edits; empty often means create-from-baseline.
    candidate_ref: ''
    # Immutable baseline revision the candidate must descend from so lineage stays auditable.
    baseline_ref: ''
    # Versioned EDA-tool recipe name; the framework adapter rejects unknown recipes.
    recipe: ''
    # PVT corner (process/voltage/temperature). Empty when the job is not corner-specific.
    corner: ''
    # direct_function calls Python tools in-process rather than shelling out.
    mode: ''
    # Field `parameter` = `''` for agent `performance_modeling`.
    parameter: ''
    # Field `values` = `''` for agent `performance_modeling`.
    values: ''
  # Queues an EDA tool job through the bound adapter (stubbed as not_run until bound).
  action: submit_tool_job
  # Documented parameter list for UI and schema generation.
  params:
  # Stable agent id used in routing, telemetry, and delegate targets.
  - name: candidate_ref
    # One-line charter of what this agent owns in the chip flow.
    description: Candidate the job reads.
  # Stable agent id used in routing, telemetry, and delegate targets.
  - name: baseline_ref
    # One-line charter of what this agent owns in the chip flow.
    description: Baseline used when the job compares against a known result.
  # Stable agent id used in routing, telemetry, and delegate targets.
  - name: recipe
    # One-line charter of what this agent owns in the chip flow.
    description: Versioned tool recipe. The adapter rejects an unknown recipe.
  # Stable agent id used in routing, telemetry, and delegate targets.
  - name: corner
    # One-line charter of what this agent owns in the chip flow.
    description: PVT corner. Empty when the job is not corner-specific.
  # Stable agent id used in routing, telemetry, and delegate targets.
  - name: mode
    # One-line charter of what this agent owns in the chip flow.
    description: Functional or analysis mode. Empty when the job is not mode-specific.
  # Stable agent id used in routing, telemetry, and delegate targets.
  - name: parameter
    # One-line charter of what this agent owns in the chip flow.
    description: Parameter to sweep.
  # Stable agent id used in routing, telemetry, and delegate targets.
  - name: values
    # One-line charter of what this agent owns in the chip flow.
    description: Comma-separated values.
# Identifier `read_projected_metrics` under `skills` for `performance_modeling`.
- id: read_projected_metrics
  # Module path exporting the skill callable (always `tools` here).
  module: tools
  # Python function in tools.py implementing this skill.
  callable: read_projected_metrics
  # One-line charter of what this agent owns in the chip flow.
  description: Read throughput, latency, and utilization from a model run.
  # Default argument values when the planner omits them.
  args_defaults:
    # Artifact URI of the isolated design candidate this skill reads or edits; empty often means create-from-baseline.
    candidate_ref: ''
    # Artifact URI of a prior report. Empty reads the latest report for this candidate.
    report_ref: ''
    # PVT corner (process/voltage/temperature). Empty when the job is not corner-specific.
    corner: ''
    # direct_function calls Python tools in-process rather than shelling out.
    mode: ''
  # Reads structured report artifacts without mutating the candidate.
  action: read_reports
  # Documented parameter list for UI and schema generation.
  params:
  # Stable agent id used in routing, telemetry, and delegate targets.
  - name: candidate_ref
    # One-line charter of what this agent owns in the chip flow.
    description: Candidate whose reports are read.
  # Stable agent id used in routing, telemetry, and delegate targets.
  - name: report_ref
    # One-line charter of what this agent owns in the chip flow.
    description: Artifact URI of the report. Empty reads the latest report for this candidate.
  # Stable agent id used in routing, telemetry, and delegate targets.
  - name: corner
    # One-line charter of what this agent owns in the chip flow.
    description: Corner filter. Empty reads every available corner.
  # Stable agent id used in routing, telemetry, and delegate targets.
  - name: mode
    # One-line charter of what this agent owns in the chip flow.
    description: Mode filter. Empty reads every available mode.
# Identifier `read_sensitivity` under `skills` for `performance_modeling`.
- id: read_sensitivity
  # Module path exporting the skill callable (always `tools` here).
  module: tools
  # Python function in tools.py implementing this skill.
  callable: read_sensitivity
  # One-line charter of what this agent owns in the chip flow.
  description: Read how a projected metric moves when one assumption changes.
  # Default argument values when the planner omits them.
  args_defaults:
    # Artifact URI of the isolated design candidate this skill reads or edits; empty often means create-from-baseline.
    candidate_ref: ''
    # Artifact URI of a prior report. Empty reads the latest report for this candidate.
    report_ref: ''
    # PVT corner (process/voltage/temperature). Empty when the job is not corner-specific.
    corner: ''
    # direct_function calls Python tools in-process rather than shelling out.
    mode: ''
  # Reads structured report artifacts without mutating the candidate.
  action: read_reports
  # Documented parameter list for UI and schema generation.
  params:
  # Stable agent id used in routing, telemetry, and delegate targets.
  - name: candidate_ref
    # One-line charter of what this agent owns in the chip flow.
    description: Candidate whose reports are read.
  # Stable agent id used in routing, telemetry, and delegate targets.
  - name: report_ref
    # One-line charter of what this agent owns in the chip flow.
    description: Artifact URI of the report. Empty reads the latest report for this candidate.
  # Stable agent id used in routing, telemetry, and delegate targets.
  - name: corner
    # One-line charter of what this agent owns in the chip flow.
    description: Corner filter. Empty reads every available corner.
  # Stable agent id used in routing, telemetry, and delegate targets.
  - name: mode
    # One-line charter of what this agent owns in the chip flow.
    description: Mode filter. Empty reads every available mode.
# Identifier `compare_model_to_requirement` under `skills` for `performance_modeling`.
- id: compare_model_to_requirement
  # Module path exporting the skill callable (always `tools` here).
  module: tools
  # Python function in tools.py implementing this skill.
  callable: compare_model_to_requirement
  # One-line charter of what this agent owns in the chip flow.
  description: Compare projected metrics with the numeric requirement.
  # Default argument values when the planner omits them.
  args_defaults:
    # Artifact URI of the isolated design candidate this skill reads or edits; empty often means create-from-baseline.
    candidate_ref: ''
    # Artifact URI of a prior report. Empty reads the latest report for this candidate.
    report_ref: ''
    # PVT corner (process/voltage/temperature). Empty when the job is not corner-specific.
    corner: ''
    # direct_function calls Python tools in-process rather than shelling out.
    mode: ''
  # Reads structured report artifacts without mutating the candidate.
  action: read_reports
  # Documented parameter list for UI and schema generation.
  params:
  # Stable agent id used in routing, telemetry, and delegate targets.
  - name: candidate_ref
    # One-line charter of what this agent owns in the chip flow.
    description: Candidate whose reports are read.
  # Stable agent id used in routing, telemetry, and delegate targets.
  - name: report_ref
    # One-line charter of what this agent owns in the chip flow.
    description: Artifact URI of the report. Empty reads the latest report for this candidate.
  # Stable agent id used in routing, telemetry, and delegate targets.
  - name: corner
    # One-line charter of what this agent owns in the chip flow.
    description: Corner filter. Empty reads every available corner.
  # Stable agent id used in routing, telemetry, and delegate targets.
  - name: mode
    # One-line charter of what this agent owns in the chip flow.
    description: Mode filter. Empty reads every available mode.
# Identifier `report_bottlenecks` under `skills` for `performance_modeling`.
- id: report_bottlenecks
  # Module path exporting the skill callable (always `tools` here).
  module: tools
  # Python function in tools.py implementing this skill.
  callable: report_bottlenecks
  # One-line charter of what this agent owns in the chip flow.
  description: Publish the dominant throughput or latency limiters.
  # Default argument values when the planner omits them.
  args_defaults:
    # One-sentence finding text published into shared engineering memory.
    summary: ''
    # Comma-separated artifact URIs that back the finding for later audit.
    evidence_refs: ''
    # Finding severity: low, medium, high, or critical.
    severity: ''
    # Agent id that should act next on this finding (lead or specialist).
    recommended_recipient: ''
  # Publishes a finding into shared memory for leads and validators.
  action: publish_finding
  # Documented parameter list for UI and schema generation.
  params:
  # Stable agent id used in routing, telemetry, and delegate targets.
  - name: summary
    # One-line charter of what this agent owns in the chip flow.
    description: One-sentence finding.
  # Stable agent id used in routing, telemetry, and delegate targets.
  - name: evidence_refs
    # One-line charter of what this agent owns in the chip flow.
    description: Comma-separated artifact URIs that support the finding.
  # Stable agent id used in routing, telemetry, and delegate targets.
  - name: severity
    # One-line charter of what this agent owns in the chip flow.
    description: low, medium, high, or critical.
  # Stable agent id used in routing, telemetry, and delegate targets.
  - name: recommended_recipient
    # One-line charter of what this agent owns in the chip flow.
    description: Agent id that should act on the finding.
# Identifier `report_model_uncertainty` under `skills` for `performance_modeling`.
- id: report_model_uncertainty
  # Module path exporting the skill callable (always `tools` here).
  module: tools
  # Python function in tools.py implementing this skill.
  callable: report_model_uncertainty
  # One-line charter of what this agent owns in the chip flow.
  description: Publish which projections are sensitive to an unmeasured assumption.
  # Default argument values when the planner omits them.
  args_defaults:
    # One-sentence finding text published into shared engineering memory.
    summary: ''
    # Comma-separated artifact URIs that back the finding for later audit.
    evidence_refs: ''
    # Finding severity: low, medium, high, or critical.
    severity: ''
    # Agent id that should act next on this finding (lead or specialist).
    recommended_recipient: ''
  # Publishes a finding into shared memory for leads and validators.
  action: publish_finding
  # Documented parameter list for UI and schema generation.
  params:
  # Stable agent id used in routing, telemetry, and delegate targets.
  - name: summary
    # One-line charter of what this agent owns in the chip flow.
    description: One-sentence finding.
  # Stable agent id used in routing, telemetry, and delegate targets.
  - name: evidence_refs
    # One-line charter of what this agent owns in the chip flow.
    description: Comma-separated artifact URIs that support the finding.
  # Stable agent id used in routing, telemetry, and delegate targets.
  - name: severity
    # One-line charter of what this agent owns in the chip flow.
    description: low, medium, high, or critical.
  # Stable agent id used in routing, telemetry, and delegate targets.
  - name: recommended_recipient
    # One-line charter of what this agent owns in the chip flow.
    description: Agent id that should act on the finding.
# Identifier `flag_model_requirement_miss` under `skills` for `performance_modeling`.
- id: flag_model_requirement_miss
  # Module path exporting the skill callable (always `tools` here).
  module: tools
  # Python function in tools.py implementing this skill.
  callable: flag_model_requirement_miss
  # One-line charter of what this agent owns in the chip flow.
  description: Publish a requirement the model says the candidate misses.
  # Default argument values when the planner omits them.
  args_defaults:
    # One-sentence finding text published into shared engineering memory.
    summary: ''
    # Comma-separated artifact URIs that back the finding for later audit.
    evidence_refs: ''
    # Finding severity: low, medium, high, or critical.
    severity: ''
    # Agent id that should act next on this finding (lead or specialist).
    recommended_recipient: ''
  # Publishes a finding into shared memory for leads and validators.
  action: publish_finding
  # Documented parameter list for UI and schema generation.
  params:
  # Stable agent id used in routing, telemetry, and delegate targets.
  - name: summary
    # One-line charter of what this agent owns in the chip flow.
    description: One-sentence finding.
  # Stable agent id used in routing, telemetry, and delegate targets.
  - name: evidence_refs
    # One-line charter of what this agent owns in the chip flow.
    description: Comma-separated artifact URIs that support the finding.
  # Stable agent id used in routing, telemetry, and delegate targets.
  - name: severity
    # One-line charter of what this agent owns in the chip flow.
    description: low, medium, high, or critical.
  # Stable agent id used in routing, telemetry, and delegate targets.
  - name: recommended_recipient
    # One-line charter of what this agent owns in the chip flow.
    description: Agent id that should act on the finding.
# Identifier `record_model_version` under `skills` for `performance_modeling`.
- id: record_model_version
  # Module path exporting the skill callable (always `tools` here).
  module: tools
  # Python function in tools.py implementing this skill.
  callable: record_model_version
  # One-line charter of what this agent owns in the chip flow.
  description: Record the model source, inputs, and version used for a projection.
  # Default argument values when the planner omits them.
  args_defaults:
    # One-sentence finding text published into shared engineering memory.
    summary: ''
    # Comma-separated artifact URIs that back the finding for later audit.
    evidence_refs: ''
    # Finding severity: low, medium, high, or critical.
    severity: ''
    # Agent id that should act next on this finding (lead or specialist).
    recommended_recipient: ''
  # Publishes a finding into shared memory for leads and validators.
  action: publish_finding
  # Documented parameter list for UI and schema generation.
  params:
  # Stable agent id used in routing, telemetry, and delegate targets.
  - name: summary
    # One-line charter of what this agent owns in the chip flow.
    description: One-sentence finding.
  # Stable agent id used in routing, telemetry, and delegate targets.
  - name: evidence_refs
    # One-line charter of what this agent owns in the chip flow.
    description: Comma-separated artifact URIs that support the finding.
  # Stable agent id used in routing, telemetry, and delegate targets.
  - name: severity
    # One-line charter of what this agent owns in the chip flow.
    description: low, medium, high, or critical.
  # Stable agent id used in routing, telemetry, and delegate targets.
  - name: recommended_recipient
    # One-line charter of what this agent owns in the chip flow.
    description: Agent id that should act on the finding.
# Local memory store configuration for this agent process.
memory:
  # Named stores the agent may read/write through the memory API.
  stores:
  # Identifier `journal` under `stores` for `performance_modeling`.
  - id: journal
    # One-line charter of what this agent owns in the chip flow.
    description: Local cache of task journal keys. Shared engineering memory is the silicon store.
    # Memory store type `list`.
    type: list
    # file means journal keys are cached on local disk.
    persistence: file
    # Store-specific configuration block.
    config:
      # Local journal cache root; override with SILICON_MEMORY_ROOT.
      path: ${SILICON_MEMORY_ROOT:-/tmp/silicon_memory}
# Heartbeat and telemetry wiring for fleet dashboards.
observability:
  # Seconds between liveness heartbeats to telemetry.
  heartbeat_interval_secs: 5
  # Where structured skill and artifact events are shipped.
  telemetry:
    # Telemetry base URL; override with TELEMETRY_URL.
    endpoint: ${TELEMETRY_URL}
    # Named event streams this agent emits.
    streams:
    # Stable agent id used in routing, telemetry, and delegate targets.
    - name: skill_calls
      # One-line charter of what this agent owns in the chip flow.
      description: Tool invocations.
    # Stable agent id used in routing, telemetry, and delegate targets.
    - name: artifacts
      # One-line charter of what this agent owns in the chip flow.
      description: Structured task results.
# Container image metadata used by compose generation.
deployment:
  # Container image tag built from this agent's Dockerfile.
  image: agentfleet/performance_modeling:1.0
  # Dockerfile path relative to this agent directory.
  dockerfile: Dockerfile
  # Environment variables injected at container start.
  environment:
    # Empty keeps adapters unbound; set to enable real tool execution.
    EDA_FRAMEWORK: ${EDA_FRAMEWORK:-}
# Policy for which shared-memory records enter the LLM context window.
context:
  # Record kinds always considered for context assembly.
  include:
  # Context include kind: human_intent (pulled into LLM context when present).
  - human_intent
  # Context include kind: requirements (pulled into LLM context when present).
  - requirements
  # Context include kind: interface_contracts (pulled into LLM context when present).
  - interface_contracts
  # Context include kind: decisions (pulled into LLM context when present).
  - decisions
  # Context include kind: open_findings (pulled into LLM context when present).
  - open_findings
  # Record kinds never considered even if present.
  exclude:
  # Context exclude kind: stale_candidates (never assembled into prompts).
  - stale_candidates
  # States removed before ranking (e.g. rejected).
  drop:
  # Drop memory state before ranking: rejected.
  - rejected
  # Preferred record states first when trimming to token_budget.
  precedence:
  # Prefer memory state `human-authored` when trimming to token_budget.
  - human-authored
  # Prefer memory state `validated` when trimming to token_budget.
  - validated
  # Prefer memory state `provisional` when trimming to token_budget.
  - provisional
  # States kept even when over budget (usually human-authored).
  protect:
  # Never drop memory state `human-authored` even when over budget.
  - human-authored
  # Approximate max tokens of assembled context (80000).
  token_budget: 80000